### shortcuts Learning

In [ ]:
 2+2

In [ ]:
# # this is a cell

In [ ]:
"This is code cell"

In [ ]:
## m - markdown
## y - code
## run - Shift+enter
## run & Add - Shift + Alt
## a -Add new cell above
## b - add new cell below
## d d- to drop the cell

In [ ]:
print(2+2)
print(2+3)

In [ ]:
var=2
print ('Addition of {} and {} is {}'.format(var,3,5))

In [ ]:
seq=[1,2,3,4,5]

In [ ]:
def findval(seq):
    if 5 in seq:
        return True
    else:
        return False

In [ ]:
findval(seq)

In [ ]:
for item in seq:
    print(item)

In [ ]:
i=1
while i<5 :
    print('i is {}'.format(i))
    i=i+1

In [ ]:
for x in range(0,5):
    print(x)

In [ ]:
list(range(10))

In [ ]:
x=[1,2,3,4]
out= []

for num in x:
    out.append(num **2)
print(out)

In [ ]:
[num**2 for num in x]

In [ ]:
def square(num):
    """
    THIS IS A SQUARE FUNC
    
    """
    return num**2

In [ ]:
output=square(2)

In [ ]:
print(output)

In [ ]:
list(map(lambda num:num*3,x))

In [ ]:
list(filter(lambda num:num%2==0,seq))

In [ ]:
def countDog(x):
       return x.split().count('dog')

In [ ]:
countDog('This dog runs faster than the other dog dude!')

In [ ]:
seq=['soup','dog','salad','cat','great']
list(filter(lambda word:word[0]=='s',seq))

In [ ]:
conda install -c anaconda numpy

In [ ]:
import sys
!conda install --yes --prefix {sys.prefix} numpy

In [ ]:
import numpy as np

In [ ]:
print (np.__version__)

In [ ]:
arr=np.arange(0,11)

In [ ]:
arr

In [ ]:
arr[1:5]

In [ ]:
arr[:6]

In [ ]:
arr[5:]

In [ ]:
arr=np.arange(50).reshape(5,10)

In [ ]:
arr

In [ ]:
arr[1:3,3:5]

In [ ]:
conda install -c anaconda pandas

In [2]:
import pandas as pd
import numpy as np

In [ ]:
outside='G1 G1 G1 G2 G2 G2'.split()
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
heir_index

In [ ]:
heir_index=pd.MultiIndex.from_tuples(heir_index)
heir_index

In [ ]:
df=pd.DataFrame(np.random.randn(6,2),heir_index,['A','B'])

In [ ]:
df

In [ ]:
df.loc['G1'].loc[1]

In [ ]:
df.index.names=['Groups','Num']

In [ ]:
df.loc['G2'].loc[2]['B']

In [ ]:
df.xs(1,level='Num')

In [ ]:
d={'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
d

In [ ]:
df=pd.DataFrame(d)

In [ ]:
df.index.names=['SNo']

In [ ]:
df

In [ ]:
df.dropna(axis=1)

In [ ]:
df['A'].fillna(df['A'].mean())

In [ ]:
df=pd.DataFrame({'Col1':[1,2,3,4],'Col2':[444,555,666,444],'Col3':['abc','def','ghi','xyz']})

In [ ]:
df

In [ ]:
df['Col2'].apply(lambda x: x*2)

In [3]:
conda install -c anaconda lxml

Note: you may need to restart the kernel to use updated packages.

In [4]:
conda install -c anaconda html5lib

Note: you may need to restart the kernel to use updated packages.

In [5]:
conda install -c anaconda BeautifulSoup4

Note: you may need to restart the kernel to use updated packages.

In [ ]:
conda install -c anaconda sqlalchemy

In [3]:
df=pd.read_csv('example')

In [16]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [29]:
type(data)

list

In [31]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [4]:
import sqlalchemy as sa
engine=sa.create_engine('sqlite:///:memory:')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_sql('My_Table',engine)

In [8]:
sqldf=pd.read_sql('My_Table',con=engine)

In [9]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15